; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v6 - type_2 ?v7 - type_3)
 	      (pred_3 ?v8 - object ?v7 - type_3)
	      (pred_1 ?v6 - type_2 ?v1 - type_1)
	      (pred_4 ?v6 - type_2 ?v8 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v6 - type_2 ?v4 ?v2 - type_3)
       :precondition (and  (pred_2 ?v6 ?v4))
       :effect (and  (pred_2 ?v6 ?v2)
		     (not (pred_2 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_2 ?v5 - object ?v3 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v5 ?v3) (pred_2 ?v6 ?v3) (pred_1 ?v6 ?v1))
       :effect (and (pred_4 ?v6 ?v5 ?v1)
		    (not (pred_3 ?v5 ?v3)) 
		    (not (pred_1 ?v6 ?v1))))

   (:action op_3
       :parameters (?v6 - type_2 ?v5 - object ?v3 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v5 ?v1) (pred_2 ?v6 ?v3))
       :effect (and (pred_3 ?v5 ?v3)
		    (pred_1 ?v6 ?v1)
		    (not (pred_4 ?v6 ?v5 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_12 - type_2
obj_09 obj_03 obj_10 obj_05 - type_1
obj_01 obj_08 obj_11 obj_06 - type_3
obj_04 obj_02 obj_07 - object)
(:init
(pred_2 obj_13 obj_01)
(pred_1 obj_13 obj_09)
(pred_1 obj_13 obj_03)
(pred_2 obj_12 obj_01)
(pred_1 obj_12 obj_10)
(pred_1 obj_12 obj_05)
(pred_3 obj_04 obj_06)
(pred_3 obj_02 obj_11)
(pred_3 obj_07 obj_01)
)
(:goal
(and
(pred_3 obj_04 obj_01)
(pred_3 obj_02 obj_08)
(pred_3 obj_07 obj_11)
)
)

(:constraints
  (always (not (pred_2 obj_13 obj_11)))
)
)

; plan
1. (op_1 obj_13 obj_07 obj_01 obj_03)
   deleted: (pred_3 obj_07 obj_01) (pred_1 obj_13 obj_03)
   added: (pred_4 obj_13 obj_07 obj_03)
   goals met: 0 of 3
2. (op_2 obj_12 obj_01 obj_11)
   deleted: (pred_2 obj_12 obj_01)
   added: (pred_2 obj_12 obj_11)
   goals met: 0 of 3
3. (op_1 obj_12 obj_02 obj_11 obj_05)
   deleted: (pred_3 obj_02 obj_11) (pred_1 obj_12 obj_05)
   added: (pred_4 obj_12 obj_02 obj_05)
   goals met: 0 of 3
4. (op_2 obj_13 obj_01 obj_06)
   deleted: (pred_2 obj_13 obj_01)
   added: (pred_2 obj_13 obj_06)
   goals met: 0 of 3
5. (op_2 obj_12 obj_11 obj_08)
   deleted: (pred_2 obj_12 obj_11)
   added: (pred_2 obj_12 obj_08)
   goals met: 0 of 3
6. (op_1 obj_13 obj_04 obj_06 obj_09)
   deleted: (pred_3 obj_04 obj_06) (pred_1 obj_13 obj_09)
   added: (pred_4 obj_13 obj_04 obj_09)
   goals met: 0 of 3
7. (op_3 obj_12 obj_02 obj_08 obj_05)
   deleted: (pred_4 obj_12 obj_02 obj_05)
   added: (pred_3 obj_02 obj_08) (pred_1 obj_12 obj_05)
   goals met: 1 of 3
8. (op_2 obj_13 obj_06 obj_01)
   deleted: (pred_2 obj_13 obj_06)
   added: (pred_2 obj_13 obj_01)
   goals met: 1 of 3
9. (op_3 obj_13 obj_04 obj_01 obj_09)
   deleted: (pred_4 obj_13 obj_04 obj_09)
   added: (pred_3 obj_04 obj_01) (pred_1 obj_13 obj_09)
   goals met: 2 of 3
10. (op_2 obj_13 obj_01 obj_08)
   deleted: (pred_2 obj_13 obj_01)
   added: (pred_2 obj_13 obj_08)
   goals met: 2 of 3
11. (op_3 obj_13 obj_07 obj_08 obj_03)
   deleted: (pred_4 obj_13 obj_07 obj_03)
   added: (pred_3 obj_07 obj_08) (pred_1 obj_13 obj_03)
   goals met: 2 of 3
12. (op_1 obj_12 obj_07 obj_08 obj_05)
   deleted: (pred_3 obj_07 obj_08) (pred_1 obj_12 obj_05)
   added: (pred_4 obj_12 obj_07 obj_05)
   goals met: 2 of 3
13. (op_2 obj_12 obj_08 obj_11)
   deleted: (pred_2 obj_12 obj_08)
   added: (pred_2 obj_12 obj_11)
   goals met: 2 of 3
14. (op_3 obj_12 obj_07 obj_11 obj_05)
   deleted: (pred_4 obj_12 obj_07 obj_05)
   added: (pred_3 obj_07 obj_11) (pred_1 obj_12 obj_05)
   goals met: 3 of 3
